Repository: mishin/perldoc-ru
Catalog: pod2-ru/tm/The Grails Framework 2.0.0 - Reference Documentation-level2.tmx
Source language: en_us
Languages: ru_ru

source: (Quick Reference)
ru_ru: (Справочник)

source: (bang) commands, you get file path auto completion - ideal for external commands that operate on the file system such as 'ls', 'cat', 'git', etc.
ru_ru: (bang - восклицательный знак), вы получите автозавершение пути файла - идеальное решение для внешних команд, которые оперируют с файловой системой, такие как 'ls', 'cat', 'git', и т.п.

source: // Do it this way instead.
ru_ru: // Вместо этого, сделайте так.

source: // This won't work!
ru_ru: // Это не будет работать!

source: // action as a method def index() {
ru_ru: // акция как метод def index() {

source: // remaining }
ru_ru: // остальное }

source: 1 Introduction
ru_ru: 1 Введение

source: 1 Introduction - Reference Documentation
ru_ru: 1 Введение - Справочная документация

source: 1 Introduction 2.0.0
ru_ru: 1 Введение в 2.0.0

source: 2 Getting Started
ru_ru: 2 Приступая к работе

source: 2 Getting Started - Reference Documentation
ru_ru: 2 Приступая к работе - Справочная документация

source: 3 Configuration
ru_ru: 3 Конфигурация

source: 3 Configuration - Reference Documentation
ru_ru: 3 Конфигурация - Справочная документация

source: 3 Configuration 2.0.0
ru_ru: 3 Конфигурация 2.0.0

source: 4 The Command Line
ru_ru: 4 Командная строка

source: 4 The Command Line - Reference Documentation
ru_ru: 4 Командная строка - Справочная документация

source: 4 The Command Line 2.0.0
ru_ru: 4 Командная строка 2.0.0

source: 5 Object Relational Mapping (GORM)
ru_ru: 5 Объектно-реляционное сопоставление (GORM)

source: 5 Object Relational Mapping (GORM) - Reference Documentation
ru_ru: 5 Объектно-реляционное сопоставление (GORM) - Справочная документация

source: 5 Object Relational Mapping (GORM) 2.0.0
ru_ru: 5 Объектно-реляционное сопоставление (GORM) 2.0.0

source: << 1Introduction
ru_ru: << 1Введение

source: << 2Getting Started
ru_ru: 2Приступая к работе

source: Quick Reference (hide)
ru_ru: Справочник (скрыть)

source: grails.config.locations - The location of properties files or addition Grails Config files that should be merged with main configuration
ru_ru: grails.config.locations - Размещение файлов свойств или дополнительных Grails Config файлов, которые должны будут быть обьеденены в общую конфигурацию

source: grails.enable.native2ascii - Set this to false if you do not require native2ascii conversion of Grails i18n properties files
ru_ru: grails.enable.native2ascii - Установите это в false если вам не требуется конверсия native2ascii файлов i18n свойств Grails

source: grails.mime.file.extensions - Whether to use the file extension to dictate the mime type in Content Negotiation
ru_ru: grails.mime.file.extensions - Используется ли расширение файла для установления mime типа в Content Negotiation

source: grails.mime.types - A map of supported mime types used for Content Negotiation
ru_ru: grails.mime.types - Сопоставление поддерживаемых mime типов, используемых для Content Negotiation

source: grails.project.war.file - Sets the name and location of the WAR file generated by the war command
ru_ru: grails.project.war.file - Устанавливает имя и расположение файла WAR, генерируемое командой war

source: grails.serverURL - A string specifying the server URL portion of absolute links, including server name e.g. grails.serverURL="http://my.yourportal.com".
ru_ru: grails.serverURL - Строка, определяющая часть URL абсолютной ссылки сервера, включая имя сервера, например grails.serverURL="http://my.yourportal.com".

source: grails.views.default.codec - Sets the default encoding regime for GSPs - can be one of 'none', 'html', or 'base64' (default: 'none').
ru_ru: grails.views.default.codec - Устанавливает режим кодирования GSP по умолчанию - может быть 'none', 'html', или 'base64' (по умолчанию: 'none').

source: grails.views.gsp.encoding - The file encoding used for GSP source files (default is 'utf-8')
ru_ru: grails.views.gsp.encoding - Кодировка файлов исходников GSP (по умолчанию 'utf-8')

source: grails.war.copyToWebApp - A closure containing Ant builder syntax that is legal inside an Ant copy, for example "fileset()".
ru_ru: grails.war.copyToWebApp - Замыкание, содержащее синтаксис Ant builder, that is legal inside an Ant copy, for example "fileset()".

source: grails.war.dependencies - A closure containing Ant builder syntax or a list of JAR filenames.
ru_ru: grails.war.dependencies - Замыкание, содержащее синтакс Ant builder, или список имен файлов JAR.

source: grails.war.resources - A closure containing Ant builder syntax.
ru_ru: grails.war.resources - Замыкание, содержащее синтакс Ant builder.

source: 1.1.1Development Environment Features
ru_ru: 1.1.1Особенности среды разработки

source: 1.1.2Core Features
ru_ru: 1.1.2Особенности ядра

source: 1.1.3Web Features
ru_ru: 1.1.3Особенности Веб

source: 1.1.4Persistence Features
ru_ru: 1.1.4Особенности Persistence

source: 1.1.5Testing Features
ru_ru: 1.1.5Особенности Тестирования

source: 1.1What's new in Grails 2.0?
ru_ru: 1.1Что нового в Grails 2.0?

source: 10Internationalization
ru_ru: 10Интернационализация

source: 11Security
ru_ru: 11Безопасность

source: 12Plugins
ru_ru: 12Плагины

source: 13Web Services
ru_ru: 13Веб службы

source: 14Grails and Spring
ru_ru: 14Grails и Spring

source: 15Grails and Hibernate
ru_ru: 15Grails и Hibernate

source: 16Scaffolding
ru_ru: 16Скаффолдинг

source: 17Deployment
ru_ru: 17Развертывание

source: 18Contributing to Grails
ru_ru: 18Участие в Grails

source: 1Introduction
ru_ru: 1Введение

source: 2.10Testing an Application
ru_ru: 2.10Тестирование Приложения

source: 2.11Deploying an Application
ru_ru: 2.11Развертывание Приложения

source: 2.12Supported Java EE Containers
ru_ru: 2.12Поддержка контейнера Java EE

source: 2.13Generating an Application
ru_ru: 2.13Создание приложения

source: 2.14Creating Artefacts
ru_ru: 2.14Создание артефактов

source: 2.1Installation Requirements
ru_ru: 2.1Требования по установке

source: 2.2Downloading and Installing
ru_ru: 2.2Загрузка и установка

source: 2.3Upgrading from previous versions of Grails
ru_ru: 2.3Обновление предыдущей версии Grails

source: 2.4Creating an Application
ru_ru: 2.4Создание приложения

source: 2.5A Hello World Example
ru_ru: 2.5Пример Hello World

source: 2.6Using Interactive Mode
ru_ru: 2.6Использование интерактивного режима

source: 2.8Convention over Configuration
ru_ru: 2.8Соглашения вместо конфигурации

source: 2.9Running an Application
ru_ru: 2.9Запуск Приложения

source: 2Getting Started
ru_ru: 2Приступая к работе

source: 2Getting Started >>
ru_ru: 2Приступая к работе >>

source: 3.1.1Built in options
ru_ru: 3.1.1Встроенные настройки

source: 3.1.2Logging
ru_ru: 3.1.2Протоколирование

source: 3.1Basic Configuration
ru_ru: 3.1Базовая конфигурация

source: 3.2Environments
ru_ru: 3.2Среды

source: 3.3.1DataSources and Environments
ru_ru: 3.3.1Источники данных и среды

source: 3.3.2JNDI DataSources
ru_ru: 3.3.2Источник данных JNDI

source: 3.3.3Automatic Database Migration
ru_ru: 3.3.3Автоматическое преобразование базы данных

source: 3.3.4Transaction-aware DataSource Proxy
ru_ru: 3.3.4DataSource Proxy с поддержкой транзакций

source: 3.3.5Database Console
ru_ru: 3.3.5Консоль базы данных

source: 3.3.6Multiple Datasources
ru_ru: 3.3.6Множественные источники данных

source: 3.3The DataSource
ru_ru: 3.3Источники данных

source: 3.4Externalized Configuration
ru_ru: 3.4Внешняя конфигурация

source: 3.5Versioning
ru_ru: 3.5Управление версиями

source: 3.6Project Documentation
ru_ru: 3.6Документация проекта

source: 3.7.10Plugin Dependencies
ru_ru: 3.7.10Зависимости плагинов

source: 3.7.1Configurations and Dependencies
ru_ru: 3.7.1Зависимости и конфигурация

source: 3.7.2Dependency Repositories
ru_ru: 3.7.2Репозитории зависимостей

source: 3.7.3Debugging Resolution
ru_ru: 3.7.3Отладка решений

source: 3.7.4Inherited Dependencies
ru_ru: 3.7.4Унаследованные зависимости

source: 3.7.5Providing Default Dependencies
ru_ru: 3.7.5Обеспечение зависимостей по умолчанию

source: 3.7.6Dependency Reports
ru_ru: 3.7.6Отчеты зависимостей

source: 3.7.7Plugin JAR Dependencies
ru_ru: 3.7.7Зависимости JAR плагинов

source: 3.7.8Maven Integration
ru_ru: 3.7.8Интеграция Maven

source: 3.7.9Deploying to a Maven Repository
ru_ru: 3.7.9Развертывание в репозиторий Maven

source: 3.7Dependency Resolution
ru_ru: 3.7Решение зависимостей

source: 3Configuration
ru_ru: 3Конфигурация

source: 3Configuration >>
ru_ru: 3Конфигурация >>

source: 4.1Interactive Mode
ru_ru: 4.1Интерактивный режим

source: 4.2Creating Gant Scripts
ru_ru: 4.2Создание Gant скриптов

source: 4.3Re-using Grails scripts
ru_ru: 4.3Повторное использование Grails скриптов

source: 4.4Hooking into Events
ru_ru: 4.4Подключение к событиям

source: 4.5Customising the build
ru_ru: 4.5Настройка построения

source: 4.6Ant and Maven
ru_ru: 4.6Ant и Maven

source: 4The Command Line
ru_ru: 4Командная строка

source: 4The Command Line >>
ru_ru: 4Командная строка>>

source: 5.1.1Basic CRUD
ru_ru: 5.1.1Основные CRUD

source: 5.1Quick Start Guide
ru_ru: 5.1Краткое руководство

source: 5.2.1.1Many-to-one and one-to-one
ru_ru: 5.2.1.1Многие-к-одному и один-к-одному

source: 5.2.1.2One-to-many
ru_ru: 5.2.1.2Один-ко-многим

source: 5.2.1.3Many-to-many
ru_ru: 5.2.1.3Многие-ко-многим

source: 5.2.1.4Basic Collection Types
ru_ru: 5.2.1.4Основные типы коллекций

source: 5.2.1Association in GORM
ru_ru: 5.2.1Ассоциации в GORM

source: 5.2.2Composition in GORM
ru_ru: 5.2.2Компоновка в GORM

source: 5.2.3Inheritance in GORM
ru_ru: 5.2.3Наследование в GORM

source: 5.2.4Sets, Lists and Maps
ru_ru: 5.2.4Наборы, списки и карты

source: 5.2Domain Modelling in GORM
ru_ru: 5.2Моделирование Доменов в GORM

source: 5.3.1Saving and Updating
ru_ru: 5.3.1Сохранение и обновление

source: 5.3.2Deleting Objects
ru_ru: 5.3.2Удаление обьектов

source: 5.3.3Understanding Cascading Updates and Deletes
ru_ru: 5.3.3Понимание каскадного удаления и обновления

source: 5.3.4Eager and Lazy Fetching
ru_ru: 5.3.4Энергичная и ленивая выборка

source: 5.3.5Pessimistic and Optimistic Locking
ru_ru: 5.3.5Пессимистическая и оптимистическая блокировка

source: 5.3.6Modification Checking
ru_ru: 5.3.6Проверка модификации

source: 5.3Persistence Basics
ru_ru: 5.3Основы персистенции

source: 5.4.1Dynamic Finders
ru_ru: 5.4.1Динамические средства поиска

source: 5.4.2Where Queries
ru_ru: 5.4.2Where Запросы

source: 5.4.3Criteria
ru_ru: 5.4.3Критерии

source: 5.4.4Detached Criteria
ru_ru: 5.4.4Свободные критерии

source: 5.4.5Hibernate Query Language (HQL)
ru_ru: 5.4.5Язык запросов Hibernate (HQL)

source: 5.4Querying with GORM
ru_ru: 5.4Запросы с GORM

source: 5.5.1Events and Auto Timestamping
ru_ru: 5.5.1События и автоматический Timestamping

source: 5.5.2.10Custom Hibernate Types
ru_ru: 5.5.2.10Пользовательские типы Hibernate

source: 5.5.2.11Derived Properties
ru_ru: 5.5.2.11Производные свойства

source: 5.5.2.12Custom Naming Strategy
ru_ru: 5.5.2.12Пользовательская стратегия именования

source: 5.5.2.1Table and Column Names
ru_ru: 5.5.2.1Имена таблиц и колонок

source: 5.5.2.2Caching Strategy
ru_ru: 5.5.2.2Стратегия кэширования

source: 5.5.2.3Inheritance Strategies
ru_ru: 5.5.2.3Стратегия наследования

source: 5.5.2.4Custom Database Identity
ru_ru: 5.5.2.4Пользовательская идентификация базы данных

source: 5.5.2.5Composite Primary Keys
ru_ru: 5.5.2.5Составные первичные ключи

source: 5.5.2.6Database Indices
ru_ru: 5.5.2.6Индексы юазы данных

source: 5.5.2.7Optimistic Locking and Versioning
ru_ru: 5.5.2.7Оптимистическая блокировка и управление версиями

source: 5.5.2.8Eager and Lazy Fetching
ru_ru: 5.5.2.8Нетерпеливая и ленивая выборка

source: 5.5.2.9Custom Cascade Behaviour
ru_ru: 5.5.2.9Пользовательское каскадное поведение

source: 5.5.2Custom ORM Mapping
ru_ru: 5.5.2Пользовательский ORM Mapping

source: 5.5.3Default Sort Order
ru_ru: 5.5.3Порядок сортировки по умолчанию

source: 5.5Advanced GORM Features
ru_ru: 5.5Расширенные функции GORM

source: 5.6Programmatic Transactions
ru_ru: 5.6Программируемые транзакции

source: 5.7GORM and Constraints
ru_ru: 5.7GORM и ограничения

source: 5Object Relational Mapping (GORM)
ru_ru: 5Объектно-реляционное сопоставление (GORM)

source: 5Object Relational Mapping (GORM) >>
ru_ru: 5Объектно-реляционное связывание (GORM) >>

source: 6.1.1Understanding Controllers and Actions
ru_ru: 6.1.1Понимание Контролеров и Акций

source: 6.1.2Controllers and Scopes
ru_ru: 6.1.2Контроллеры и контекст

source: 6.1.3Models and Views
ru_ru: 6.1.3Модели и виды

source: 6.1.4Redirects and Chaining
ru_ru: 6.1.4Перенаправление и связывание

source: 6.1.5Controller Interceptors
ru_ru: 6.1.5Перехватчики контроллеров

source: 6.1.6Data Binding
ru_ru: 6.1.6Связывание данных

source: 6.1.7XML and JSON Responses
ru_ru: 6.1.7XML и JSON ответы

source: 6.1.8More on JSONBuilder
ru_ru: 6.1.8Больше о JSONBuilder

source: 6.1.9Uploading Files
ru_ru: 6.1.9Загрузка файлов

source: 6.1Controllers
ru_ru: 6.1Контроллеры

source: 6The Web Layer
ru_ru: 6Веб уровень

source: 6The Web Layer >>
ru_ru: 6Веб уровень >>

source: 7Validation
ru_ru: 7Проверка

source: 8The Service Layer
ru_ru: 8Уровень служб

source: 9Testing
ru_ru: 9Тестирование

source: Authors: Graeme Rocher, Peter Ledbrook, Marc Palmer, Jeff Brown, Luke Daley, Burt Beckwith
ru_ru: Авторы: Graeme Rocher, Peter Ledbrook, Marc Palmer, Jeff Brown, Luke Daley, Burt Beckwith

source: Version: 2.0.0
ru_ru: Версия: 2.0.0

source: new Nose(face:new Face()).save() // will cause an error
ru_ru: new Nose(face:new Face()).save() // вызовет ошибку

source: A Gant script itself is similar to a regular Groovy script except that it supports the concept of "targets" and dependencies between them:
ru_ru: Сценарий Gant очень похож на обычный сценарий Groovy исключением того, что он поддерживает концепцию "целей" и зависимости между ними:

source: A Note on Collection Types and Performance
ru_ru: Заметка о типах коллекций и производительности

source: A command line scripting environment built on the Groovy-powered Gant
ru_ru: Командную строку среды выполнения скриптов, основанную на Groovy-powered Gant

source: A controller layer built on Spring MVC
ru_ru: Уровень контроллеров, основанный на Spring MVC

source: A domain class can be created with the create-domain-class command:
ru_ru: Доменные классы могут быть созданы командой create-domain-class:

source: A general purpose LinkGenerator class is now available that is usable anywhere within a Grails application and not just within the context of a controller.
ru_ru: Главная цель класса LinkGenerator теперь доступна где угодно в приложениии Grails, а не только в контексте контроллера.

source: A key thing to remember about Grails is that under the surface Grails is using Hibernate for persistence.
ru_ru: Главное помнить, что Grails под капотом использует Hibernate для персистенции.

source: A level of 'all' means that you will see all messages.
ru_ru: Уровень 'all' означает, что вы будете видеть все сообщения.

source: A logger is the object you log messages to, so in the call log.debug(msg), log is a logger instance (of type Log).
ru_ru: Регистратор это объект, который выводит ваше протоколирущее сообщение, так в вызове log.debug(msg), log это экземпляр регистратора (типа Log).

source: A many-to-one relationship is the simplest kind, and is defined with a property of the type of another domain class.
ru_ru: Отношение многие-к-одному это простейший вид, и определяется при помощи свойства типа другого домена класса.

source: A new database migration plugin has been designed and built for Grails 2.0 allowing you to apply migrations to your database, rollback changes and diff your domain model with the current state of the database.
ru_ru: Для Grails 2.0 был разработан и создан новый плагин database migration plugin, позволяющий вам осуществлять миграцию на вашу базу данных, применять изменения, и изменять ваши доменные модели в соответствии с текущим состоянием базы данных.

source: A new database reverse engineering plugin has been designed and built for Grails 2.0 that allows you to generate a domain model from an existing database schema.
ru_ru: Для Grails 2.0 был разработан и создан новый плагин database reverse engineering</a0, который позволяет вам генерировать доменные модели в соответствии с существующей схемой базы данных.

source: A new static resource abstraction is included that allows declarative handling of JavaScript, CSS and image resources including automatic ordering, compression, caching and gzip handling.
ru_ru: Введена новая абстракция статических ресурсов, что позволяет декларативно управлять JavaScript, CSS и изображениями, включая упорядочивание, сжатие, кэширование и управление gzip.

source: A new date method has been added to the params object to allow easy, null-safe parsing of dates:
ru_ru: Новый метод date, добавленный в объект params позволяет осуществить простой и нуль-безопасный парсинг дат:

source: A one-to-many relationship is when one class, example Author, has many instances of a another class, example Book.
ru_ru: Отношение один-ко-многим - когда один класс, например Author, имеет много экземпляров другого класса, например Book.

source: A transactional service layer built on Spring's transaction abstraction
ru_ru: Уровень служб транзакций, построенный на абстрактных транзакциях Spring.

source: A useful feature of Hibernate over direct JDBC calls and even other frameworks is that when you call save or delete it does not necessarily perform any SQL operations at that point.
ru_ru: Преимущество Hibernate над прямыми вызовами JDBC, и даже другими фреймворками в том, что когда вы вызываете методы save или delete, вам не нужно выполнять какие-либо операторы SQL в этот момент.

source: Abstract Inheritance
ru_ru: Абстрактное наследование

source: All of these are made easy to use through the power of the Groovy language and the extensive use of Domain Specific Languages (DSLs)
ru_ru: Все это сделано легким в использовании благодаря мощному языку Groovy и обширному использованию Domain Specific Languages (DSLs)

source: Allows the application to do any other other work before building the final WAR file
ru_ru: Позволяет приложению выполнять любые другие действия, до того как будет окончательно построен файл WAR

source: Also, hasOne only works with bidirectional relationships.
ru_ru: Также, hasOne работает только с двунаправленными отношениями.

source: Also, although we have put the call to setDefaultTarget() at the end of the script in this example, it can go anywhere as long as it comes after the target it refers to ("clean-compile" in this case).
ru_ru: Кроме того, хотя в этом примере мы и поставили вызов setDefaultTarget () в конце скрипта, it can go anywhere as long as it comes after the target it refers to ("clean-compile" in this case).

source: Although convenient, this effectively made it difficult to restructure your user guide by inserting new chapters and sections.
ru_ru: Хотя это удобно, фактически было трудно перестроить руководство пользователя путем включения новых глав и разделов.

source: An alternative approach is to use the setDefaultTarget() method:
ru_ru: Альтернативный подход - это использование метода setDefaultTarget():

source: An alternative is to use table-per-subclass which can be enabled with the ORM DSL
ru_ru: Альтернативой является использование таблица-на-подкласс которое может быть доступно с ORM DSL

source: An easy to use Object Relational Mapping (ORM) layer built on Hibernate
ru_ru: Легкий в использовании Object Relational Mapping (ORM) слой, основанный на Hibernate

source: An embedded Tomcat container which is configured for on the fly reloading
ru_ru: Встроенный контейнер Tomcat, который настроен на перезагрузку на лету.

source: An example of the new output when running tests can be seen below:
ru_ru: Пример нового вывода при выполнении тестов можно увидеть ниже:

source: An example of using the save method can be seen below:
ru_ru: Пример использующий метод save можно увидеть ниже:

source: An expressive view technology called Groovy Server Pages (GSP)
ru_ru: Выразительную технологию отображения, называемую Groovy Server Pages (GSP)

source: Arbitrary strategies may be plugged in by providing a class which implements the UrlConverter interface and adding an instance of that class to the Spring application context with the bean name of grails.web.UrlConverter.BEAN_NAME.
ru_ru: Вводя в контекст приложения Spring бин с именем grails.web.UrlConverter.BEAN_NAME и реализующего интерфейс UrlConverter , могут быть добавлены произвольные стратегии обработки URL.

source: Are they shared?
ru_ru: Являются ли они общими?

source: As demonstrated in the script above, there is an implicit ant variable (an instance of groovy.util.AntBuilder) that allows access to the Apache Ant API.
ru_ru: Как показано в сценарии выше, существует неявная переменная ant (экземпляр groovy.util.AntBuilder) которая предоставляет доступ к Apache Ant API.

source: As well as association, Grails supports the notion of composition.
ru_ru: Так же как и ассоциации, Grails поддерживает поняте композиции.

source: As well as associations between different domain classes, GORM also supports mapping of basic collection types.
ru_ru: Так же как и ассоциации между различными доменными классами, GORM также поддерживает отображение основных типов коллекций.

source: Association in GORM
ru_ru: Ассоциации в GORM

source: At the database level Grails by default uses table-per-hierarchy mapping with a discriminator column called class so the parent class (Content) and its subclasses (BlogEntry, Book etc.), share the same table.
ru_ru: На уровне базы нанных Grails по умолчанию использует отображение таблица-на-иерархию с колонкой дискриминатора class, так родительский класс (Content) и его дочерние классы (BlogEntry, Book и т.д.), расположены в одной таблице.

source: Available Targets (type grails help 'target-name' for more info): grails bootstrap grails bug-report grails clean grails compile ...
ru_ru: Доступные цели (для более подробной информации введите: grails help 'имя цели'): grails bootstrap grails bug-report grails clean grails compile ...

source: Bags of Objects
ru_ru: Множество объектов

source: Basic CRUD
ru_ru: Основные операции CRUD

source: Basic Collection Types
ru_ru: Основные типы коллекций

source: Basic Configuration
ru_ru: Базовая конфигурация

source: Before installing Grails you will as a minimum need a Java Development Kit (JDK) installed version 1.6 or above and environment variable called JAVA_HOME pointing to the location of this installation.
ru_ru: Перед установкой Grails у вас должна быть как минимум: установлена Java Development Kit (JDK) версии 1.6 или выше, и переменная окружающей среды JAVA_HOME содержащая путь к JDK.

source: Before we go on to loggers, a quick note about those 'off' and 'all' levels.
ru_ru: Прежде чем мы перейдем к регистраторам, небольшое примечание об уровнях 'off' и 'all'.

source: Below is a preview of GORM in action:
ru_ru: Ниже показан GORM в действии:

source: Binary Plugins
ru_ru: Бинарные плагины

source: Built in options
ru_ru: Встроенные опции

source: But as long as you're doing non-conflicting saves, updates, and deletes, they'll be batched until the session is flushed.
ru_ru: Но до тех пор, пока вы совершаете не конфликтующие сохранения, обновления, и удаления, они будут группироваться, пока сессия не будет сброшена.

source: But is there a logger with this name in the application?
ru_ru: Но есть ли в приложении регистратор с таким названием?

source: But when you run a script as part of an automated process, for example a continuous integration build server, there's no way to "answer" the questions.
ru_ru: Но когда вы запускаете скрипт как часть автоматического процесса, например сервера непрерывной интеграции, где нет "ответов на вопросы",
